# Программирование на языке высокого уровня (Python).
# Задание №4.3.2. Вариант 5
#
# Выполнила: Гоморина А.В.
# Группа: ПИН-б-о-21-1
# E-mail: nastyagomorinalove@gmail.com


import time



class Заказ:
    """Класс Заказ содержит информацию о заказе."""

    # Переменная класса для определения номера заказа
    счетчик_заказов = 0

    def __init__(self):
        """Конструктор класса."""
        # Хранит экземпляры класса Пицца и его потомков
        self.заказанные_пиццы = []
        Заказ.счетчик_заказов += 1

    def __str__(self):
        """Вернуть содержимое заказа и его сумму.

        Формат вывода:

        Заказ №2
        1. Пицца: Пепперони | Цена: 350.00 р.
           Тесто: тонкое Соус: томатный
           Начинка: пепперони, сыр моцарелла
        2. Пицца: Барбекю | Цена: 450.00 р.
           Тесто: тонкое Соус: барбекю
           Начинка: бекон, ветчина, зелень, сыр моцарелла
        Сумма заказа: 800.00 р.

        """
        res = f"Заказ №{self.номер_заказа}\n"
        for i, пицца in enumerate(self.заказанные_пиццы, start=1):
            res += f"{i}. {пицца}\n"
        res += f"Сумма заказа: {self.сумма():.2f} р."
        return res


    def добавить(self, пицца):
        """Добавить пиццу в заказ."""
        self.заказанные_пиццы.append(пицца)

    def сумма(self):
        """Вернуть сумму заказа."""
        return sum(пицца.цена for пицца in self.заказанные_пиццы)

    def выполнить(self):
        """Выполнить заказ.

        Для каждой пиццы в заказе: подготовить, испечь, нарезать и упаковать.
        Сообщить, что заказ готов и пожелать приятного аппетита.

        Для визуального эффекта, каждое действие осуществляется с "задержкой",
        используя time.sleep(1).

        Формат вывода:

        Заказ поступил на выполнение...
        1. Пепперони
        Начинаю готовить пиццу Пепперони
          - замешиваю тонкое тесто...
          - добавляю соус: томатный...
          - и, конечно: пепперони, сыр моцарелла...
        Выпекаю пиццу... Готово!
        Нарезаю на аппетитные кусочки...
        Упаковываю в фирменную упаковку и готово!

        Заказ №2 готов! Приятного аппетита!
        """
        print(f"Заказ поступил на выполнение...")

        for i, пицца in enumerate(self.заказанные_пиццы, start=1):
            print(f"{i}. {пицца.название}")
            print(f"Начинаю готовить пиццу {пицца.название}")
            print(f"  - замешиваю тонкое тесто...")
            print(f"  - добавляю соус: {пицца.соус}...")
            print(f"  - и, конечно: {', '.join(пицца.начинка)}...")
            print(f"Выпекаю пиццу... Готово!")
            print(f"Нарезаю на аппетитные кусочки...")
            print(f"Упаковываю в фирменную упаковку и готово!\n")
            time.sleep(1)

        print(f"Заказ №{self.номер_заказа} готов! Приятного аппетита!")
