# Программирование на языке высокого уровня (Python).
# Задание №4.3.6. Вариант 5
#
# Выполнил: Гоморина А.В.
# Группа: ПИН-б-о-21-1
# E-mail: nastyagomorinalove@gmail.com


from Билет import Билет
from БезлимитныйБилет import БезлимитныйБилет
from БилетСОграничением import БилетСОграничением
from БилетСОграничениемПоездок import БилетСОграничениемПоездок

if __name__ == "__main__":
    билет_1 = Билет(5)
    билет_1.вывод_информации()
    билет_1.пополнить_билет(3)
    билет_1.списать_поездку()
    билет_1.проверить_статус()

    безлимитный_билет = БезлимитныйБилет()
    безлимитный_билет.вывод_информации()
    безлимитный_билет.сбросить_билет()

    билет_ограниченный = БилетСОграничением(3)
    билет_ограниченный.вывод_информации()

    билет_с_ограничением_поездок = БилетСОграничениемПоездок(2)
    билет_с_ограничением_поездок.вывод_информации()
