# Программирование на языке высокого уровня (Python).
# Задание №4.3.6. Вариант 5
#
# Выполнил: Гоморина А.В.
# Группа: ПИН-б-о-21-1
# E-mail: nastyagomorinalove@gmail.com

from Билет import Билет


class БилетСОграничениемПоездок(Билет):
    def __init__(self, макс_поездок):
        super().__init__(макс_поездок)

    def информация(self):
        print(f"Билет с ограничением по поездкам. Доступно {self.количество_поездок} поездок.")

